<?php

namespace Farshad\Sms\Exceptions;

class GhasedaksmsException extends SmsException{
    const Error = [
        '500'=>  'لیست شماره تماس ها باید به صورت آرایه باشد',
        '-103'=>    'پارامتر ورودی اشتباه میباشد',
        '-102'  =>  'کد های ارسالی باید به صورت آرایه باشد',
        '1' =>  'نام کاربری یا رمز عبور معتبر نمی باشد .',
        '2' =>  'آرایه ها خالی می باشد.',
        '3' =>  'طول آرایه بیشتر از 100 می باشد .',
        '4' =>  'طول آرایه ی فرستنده و گیرنده و متن پیام با یکدیگر تطابق ندارد .',
        '5' =>  'امکان گرفتن پیام جدید وجود ندارد .',
        '6' =>  'حساب کاربری غیر فعال می باشد.
        - نام کاربری و یا رمز عبور خود را به درستی وارد نمی کنید .
        - در صورتی که به تازگی وب سرویس را فعال کرده اید از منوی تنظیمات _رمز عبور ، رمز عبور وب سرویس خود را مجدد تنظیم نمائید . ',
        '7' =>  'امکان دسترسی به خط مورد نظر وجود ندارد .',
        '8' =>  'شماره گیرنده نامعتبر است .',
        '9' =>  'حساب اعتبار ریالی مورد نیاز را دارا نمی باشد.',
        '10'=>  'خطایی در سیستم رخ داده است . دوباره سعی کنید .',
        '11'=>  'نامعتبر می باشد . IP',
        '20'=>  'شماره مخاطب فیلتر شده می باشد.',
        '21'=>  'ارتباط با سرویس دهنده قطع می باشد.',
        '24'=>  'امکان استفاده از این سرویس در پلن رایگان وجود ندارد.',
        '25'=>  'ساختار پارامترها (param1 , param2 ... param10) صحیح نمی باشد ، اگر پارامتر حاوی خط جدید،فاصله، UnderLine یا جداکننده باشد این خطا رخ میدهد'
    ];

    public function __construct($code, $message = null){
        $this->code = $code;
        
        if(isset(self::Error[$this->code]))
            $this->message = self::Error[$this->code];
        else
            $this->message = $message;
    }
}